*********************************************************************************************
;By L.Q.Y
;函数作用:打开中断
;返回:中断掩码
**********************************************************************************************

		.asg	B15,	SP							;栈指针
		.asg	B3,		return						;函数返回地址
		.asg	A4,		ret_val_32					;函数返回值

		.global int_unlock

int_unlock:	.asmfunc
			B		.S2		return
			MVC		.S2		TSR, B16
			SHL		.S1		A4, 1, A4
		||	CLR		.S2		B16, 1, 1, B16
			OR		.L2		B16, A4, B16
			MVC		.S2		B16, TSR
			RINT



			.endasmfunc
